tako-dev/takoquota-hardware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# ESP32-S3-PICO-1-N8R8: 8MB embedded flash, 8MB embedded PSRAM.
#
# PSRAM is left disabled: this demo needs 5KB for the framebuffer, and enabling
# quad PSRAM here fails ID detection on this module ("PSRAM ID read error:
# 0x00ffffff") and reboot-loops. Not worth chasing for a display test.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# BLE-only NimBLE peripheral used for secure provisioning.
CONFIG_BT_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=n
CONFIG_BTDM_CTRL_MODE_BTDM=n
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=256
CONFIG_BT_NIMBLE_NVS_PERSIST=y

# Reduce the Wi-Fi driver's IRAM footprint for this short-lived refresh task.
CONFIG_ESP_WIFI_IRAM_OPT=n

# Log over the native USB-Serial-JTAG port
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_FREERTOS_HZ=1000
